#include "CST816D.h"

#include "board_pin_def.h"
#include "pico/stdlib.h"
#include "hardware/gpio.h"

static CST816_Info CST816_Info_s;

static const CST816D_Device_t cst816d = {
    .i2c = CST816_IIC_HANDLE,
    .addr = CST816D_Device_Addr,
    .reset_pin = TOUCH_RST_PIN,
    .int_pin = TOUCH_INT_PIN,
    .sda_pin = CST816D_IIC0_SDA_PIN,
    .scl_pin = CST816D_IIC0_SCL_PIN,
    .timeout_us = CST816_IIC_TIMEOUT_US,
};

/*
*********************************************************************************************************
*	函 数 名: CST816_Init
*	功能说明: CST816初始化
*	形    参：none
*	返 回 值: none
*********************************************************************************************************
*/
void CST816_Init(void)
{
  CST816_Reset();
  CST816_Config_AutoSleepTime(5);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_IIC_ReadREG
*	功能说明: 读取触摸屏单个寄存器的数据
*	形    参：reg：寄存器地址
*	返 回 值: 返回寄存器存储的数据
*********************************************************************************************************
*/
static uint8_t CST816_IIC_ReadREG(uint8_t addr)
{
  uint8_t data;
  i2c_write_blocking(cst816d.i2c, cst816d.addr, &addr, 1, true);// 发送寄存器地址
  i2c_read_blocking(cst816d.i2c, cst816d.addr, &data, 1, true);// 读取寄存器数据
  return data;
}

/*
*********************************************************************************************************
*	函 数 名: CST816_IIC_WriteREG
*	功能说明: 向触摸屏的寄存器写入数据
*	形    参：addr：寄存器地址
*						dat:	写入的数据
*	返 回 值: 返回寄存器存储的数据
*********************************************************************************************************
*/
static void CST816_IIC_WriteREG(uint8_t addr, uint8_t dat)
{
  uint8_t buf[2] = {addr, dat};
  i2c_write_blocking(cst816d.i2c, cst816d.addr, buf, 2, true);
}

static void CST816_IIC_Read_Multi_Byte(i2c_inst_t *i2c, uint8_t dev_addr, uint8_t reg_addr, uint8_t len, uint8_t *buf)
{
  i2c_write_blocking(i2c, dev_addr, &reg_addr, 1, true); // 发送寄存器地址
  i2c_read_blocking(i2c, dev_addr, buf, len, true);      // 读取寄存器数据
}
/*
*********************************************************************************************************
*	函 数 名: TOUCH_RESET
*	功能说明: 触摸屏复位
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Reset(void)
{
  gpio_put(cst816d.reset_pin, 0);
  sleep_ms(10);
  gpio_put(cst816d.reset_pin, 1);
  sleep_ms(100);
}
/*
*********************************************************************************************************
*	函 数 名: TOUCH_READ_X
*	功能说明: 读取触摸屏在触摸时的坐标值
*	形    参：无
*	返 回 值: 无 （数据存储在CST816_Info_s结构体中）
*********************************************************************************************************
*/
void CST816_Calculate_XY_Axis(void)
{
  uint8_t DAT[4];
  CST816_IIC_Read_Multi_Byte(cst816d.i2c, cst816d.addr, CST816D_REG_XposH, 4, DAT);
  CST816_Info_s.X_Pos = ((DAT[0] & 0x0F) << 8) | DAT[1];                  //(temp[0]&0X0F)<<4|
  CST816_Info_s.Y_Pos = ((DAT[2] & 0x0F) << 8) | DAT[3]; //(temp[2]&0X0F)<<4|
}

void CST816_Get_XY_Axis(uint16_t *x, uint16_t *y)
{
  *x = CST816_Info_s.X_Pos;
  *y = CST816_Info_s.Y_Pos;
}
/*
*********************************************************************************************************
*	函 数 名: CST816_Get_FingerNum
*	功能说明: 读取触摸屏的手指触摸个数,0xFF为睡眠
*	形    参：无
*	返 回 值: 返回芯片ID
*********************************************************************************************************
*/
uint8_t CST816_Get_FingerNum(void)
{
  return CST816_IIC_ReadREG(CST816D_REG_FingerNum);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Get_ChipID
*	功能说明: 读取触摸屏的芯片ID
*	形    参：无
*	返 回 值: 返回芯片ID
*********************************************************************************************************
*/
uint8_t CST816_Get_ChipID(void)
{
  return CST816_IIC_ReadREG(CST816D_REG_ChipID);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Config_MotionMask
*	功能说明: 使能连续动作（连续左右滑动，连续上下滑动，双击）
*	形    参：mode：模式(5种)
*	返 回 值: 无
*	注    意：使能连续动作会增加响应时间
*********************************************************************************************************
*/
void CST816_Config_MotionMask(uint8_t mode)
{
  CST816_IIC_WriteREG(CST816D_REG_MotionMask, mode);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Config_AutoSleepTime
*	功能说明: 规定time内无触摸，自动进入低功耗模式
*	形    参：time：时间(s)
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Config_AutoSleepTime(uint8_t time)
{
  CST816_IIC_WriteREG(CST816D_REG_AutoSleepTime, time);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Sleep
*	功能说明: 进入睡眠，无触摸唤醒功能
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Sleep(void)
{
  CST816_IIC_WriteREG(CST816D_REG_SleepMode, 0x03);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Wakeup
*	功能说明: 唤醒
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Wakeup(void)
{
  CST816_Reset();
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Config_MotionSlAngle
*	功能说明: 手势检测滑动分区角度控制。Angle=tan(c)*10 c为以x轴正方向为基准的角度。
*	形    参：x_right_y_up_angle：角度值
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Config_MotionSlAngle(uint8_t x_right_y_up_angle)
{
  CST816_IIC_WriteREG(CST816D_REG_MotionSlAngle, x_right_y_up_angle);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Config_NorScanPer
*	功能说明: 正常快速检测周期配置函数。
*						此值会影响到LpAutoWakeTime和AutoSleepTime。
*						单位10ms，可选值：1～30。默认值为1。
*	形    参：Period：周期值
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Config_NorScanPer(uint8_t Period)
{
  if (Period >= 30)
    Period = 30;
  CST816_IIC_WriteREG(CST816D_REG_NorScanPer, Period);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Config_IrqPluseWidth
*	功能说明: 中断低脉冲输出宽度配置函数
*	形    参：Period：周期值
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Config_IrqPluseWidth(uint8_t Width)
{
  if (Width >= 200)
    Width = 200;
  CST816_IIC_WriteREG(CST816D_REG_IrqPluseWidth, Width);
}

/*
*********************************************************************************************************
*	函 数 名: CST816_Config_NorScanPer
*	功能说明: 低功耗扫描唤醒门限配置函数。越小越灵敏。默认值48
*	形    参：TH：门限值
*	返 回 值: 无
*********************************************************************************************************
*/
void CST816_Config_LpScanTH(uint8_t TH)
{
  CST816_IIC_WriteREG(CST816D_REG_LpScanTH, TH);
}
